Revit 2027 API
ParameterTypeId.ProjectRevisionRevisionNum Property
 "Revision Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectRevisionRevisionNum { get; }
Public Shared ReadOnly Property ProjectRevisionRevisionNum As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectRevisionRevisionNum {
	ForgeTypeId^ get ();
}
static member ProjectRevisionRevisionNum : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace